
// Напишите программу, которая принимает
// на вход число и выдаёт количество цифр в числе.
// 456 -> 3
// 78 -> 2
// 89126 -> 5

Console.WriteLine("введите");
int number = int.Parse(Console.ReadLine());


int GetCountNumbers(int num)
{
    int count = 0;
    while (num != 0)
    {
        num = num / 10;
        count++;
    }
    return count;
}

int result = GetCountNumbers(number);
Console.WriteLine(result);

